Converted code flow visualisation to mermaid diag
